balazsgrill/modembed/res/Devices/dsPIC30/PIC24FJ32GB004.PIC
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="ALCFGRPT" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="ALCFGRPT" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ARPT" edc:desc="" edc:mask="0xff" edc:name="ARPT" edc:nzwidth="8"/>
              <edc:SFRFieldDef edc:cname="ALRMPTR" edc:desc="" edc:mask="0x3" edc:name="ALRMPTR" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="AMASK" edc:desc="" edc:mask="0xf" edc:name="AMASK" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="CHIME" edc:desc="" edc:mask="0x1" edc:name="CHIME" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ALRMEN" edc:desc="" edc:mask="0x1" edc:name="ALRMEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ARPT0" edc:desc="" edc:mask="0x1" edc:name="ARPT0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ARPT1" edc:desc="" edc:mask="0x1" edc:name="ARPT1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ARPT2" edc:desc="" edc:mask="0x1" edc:name="ARPT2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ARPT3" edc:desc="" edc:mask="0x1" edc:name="ARPT3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ARPT4" edc:desc="" edc:mask="0x1" edc:name="ARPT4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ARPT5" edc:desc="" edc:mask="0x1" edc:name="ARPT5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ARPT6" edc:desc="" edc:mask="0x1" edc:name="ARPT6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ARPT7" edc:desc="" edc:mask="0x1" edc:name="ARPT7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ALRMPTR0" edc:desc="" edc:mask="0x1" edc:name="ALRMPTR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ALRMPTR1" edc:desc="" edc:mask="0x1" edc:name="ALRMPTR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AMASK0" edc:desc="" edc:mask="0x1" edc:name="AMASK0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AMASK1" edc:desc="" edc:mask="0x1" edc:name="AMASK1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AMASK2" edc:desc="" edc:mask="0x1" edc:name="AMASK2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AMASK3" edc:desc="" edc:mask="0x1" edc:name="AMASK3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="RTCVAL" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="RTCVAL" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RTCVAL" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="RTCVAL" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n-nrrnnnnnnnnnnn" edc:cname="RCFGCAL" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="RCFGCAL" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CAL" edc:desc="" edc:mask="0xff" edc:name="CAL" edc:nzwidth="8"/>
              <edc:SFRFieldDef edc:cname="RTCPTR" edc:desc="" edc:mask="0x3" edc:name="RTCPTR" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="RTCOE" edc:desc="" edc:mask="0x1" edc:name="RTCOE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HALFSEC" edc:desc="" edc:mask="0x1" edc:name="HALFSEC" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RTCSYNC" edc:desc="" edc:mask="0x1" edc:name="RTCSYNC" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RTCWREN" edc:desc="" edc:mask="0x1" edc:name="RTCWREN" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="RTCEN" edc:desc="" edc:mask="0x1" edc:name="RTCEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CAL0" edc:desc="" edc:mask="0x1" edc:name="CAL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CAL1" edc:desc="" edc:mask="0x1" edc:name="CAL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CAL2" edc:desc="" edc:mask="0x1" edc:name="CAL2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CAL3" edc:desc="" edc:mask="0x1" edc:name="CAL3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CAL4" edc:desc="" edc:mask="0x1" edc:name="CAL4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CAL5" edc:desc="" edc:mask="0x1" edc:name="CAL5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CAL6" edc:desc="" edc:mask="0x1" edc:name="CAL6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CAL7" edc:desc="" edc:mask="0x1" edc:name="CAL7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RTCPTR0" edc:desc="" edc:mask="0x1" edc:name="RTCPTR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RTCPTR1" edc:desc="" edc:mask="0x1" edc:name="RTCPTR1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="24"/>
        <edc:SFRDef edc:access="n-nrrrrrrrnnn---" edc:cname="CRCCON1" edc:desc="" edc:impl="0x3fdf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-00000001000---" edc:name="CRCCON1" edc:nzwidth="0x10" edc:por="0-00000001000---">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="CRCCON"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="LENDIAN" edc:desc="" edc:mask="0x1" edc:name="LENDIAN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CRCGO" edc:desc="" edc:mask="0x1" edc:name="CRCGO" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CRCISEL" edc:desc="" edc:mask="0x1" edc:name="CRCISEL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CRCMPT" edc:desc="" edc:mask="0x1" edc:name="CRCMPT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CRCFUL" edc:desc="" edc:mask="0x1" edc:name="CRCFUL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="VWORD" edc:desc="" edc:mask="0x1f" edc:name="VWORD" edc:nzwidth="5"/>
              <edc:SFRFieldDef edc:cname="CSIDL" edc:desc="" edc:mask="0x1" edc:name="CSIDL" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CRCEN" edc:desc="" edc:mask="0x1" edc:name="CRCEN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:cname="VWORD0" edc:desc="" edc:mask="0x1" edc:name="VWORD0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VWORD1" edc:desc="" edc:mask="0x1" edc:name="VWORD1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VWORD2" edc:desc="" edc:mask="0x1" edc:name="VWORD2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VWORD3" edc:desc="" edc:mask="0x1" edc:name="VWORD3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VWORD4" edc:desc="" edc:mask="0x1" edc:name="VWORD4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:FreezeBit edc:freezeval="1" edc:name="CRC" edc:pos="0xe"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn---nnnnn" edc:cname="CRCCON2" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000" edc:name="CRCCON2" edc:nzwidth="0x10" edc:por="---00000---00000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PLEN" edc:desc="" edc:mask="0x1f" edc:name="PLEN" edc:nzwidth="5"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="DWIDTH" edc:desc="" edc:mask="0x1f" edc:name="DWIDTH" edc:nzwidth="5"/>
              <edc:AdjustPoint edc:offset="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PLEN0" edc:desc="" edc:mask="0x1" edc:name="PLEN0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PLEN1" edc:desc="" edc:mask="0x1" edc:name="PLEN1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PLEN2" edc:desc="" edc:mask="0x1" edc:name="PLEN2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PLEN3" edc:desc="" edc:mask="0x1" edc:name="PLEN3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PLEN4" edc:desc="" edc:mask="0x1" edc:name="PLEN4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="DWIDTH0" edc:desc="" edc:mask="0x1" edc:name="DWIDTH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DWIDTH1" edc:desc="" edc:mask="0x1" edc:name="DWIDTH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DWIDTH2" edc:desc="" edc:mask="0x1" edc:name="DWIDTH2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DWIDTH3" edc:desc="" edc:mask="0x1" edc:name="DWIDTH3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DWIDTH4" edc:desc="" edc:mask="0x1" edc:name="DWIDTH4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnn-" edc:cname="CRCXORL" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000000000000000-" edc:name="CRCXORL" edc:nzwidth="0x10" edc:por="000000000000000-">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="CRCXOR"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="X1" edc:desc="" edc:mask="0x1" edc:name="X1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="X2" edc:desc="" edc:mask="0x1" edc:name="X2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="X3" edc:desc="" edc:mask="0x1" edc:name="X3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="X4" edc:desc="" edc:mask="0x1" edc:name="X4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="X5" edc:desc="" edc:mask="0x1" edc:name="X5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="X6" edc:desc="" edc:mask="0x1" edc:name="X6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="X7" edc:desc="" edc:mask="0x1" edc:name="X7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="X8" edc:desc="" edc:mask="0x1" edc:name="X8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="X9" edc:desc="" edc:mask="0x1" edc:name="X9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="X10" edc:desc="" edc:mask="0x1" edc:name="X10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="X11" edc:desc="" edc:mask="0x1" edc:name="X11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="X12" edc:desc="" edc:mask="0x1" edc:name="X12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="X13" edc:desc="" edc:mask="0x1" edc:name="X13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="X14" edc:desc="" edc:mask="0x1" edc:name="X14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="X15" edc:desc="" edc:mask="0x1" edc:name="X15" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
